# -*- coding: utf-8 -*-

'''
算法一、标题出现以下任意两个部分的结果
'''
#第一部分
dic1 = ["申请","征集","申报","评选","发布","组织","推荐","启动"]
#第二部分
dic2 = ["项目","课题","专项","资金","示范","试点","基地","补贴","补助","资助","认定"]
#第三部分
dic3 = ["指南","通知","公告"]

'''
算法二、标题出现以下关键词时的结果
'''
#奖项、资质类
dic4 = ["科技进步奖","专利奖","科学技术奖","最高科学技术奖","国家科技奖","自然科学奖","发明创业奖","人物奖","质量奖",
        "科学研究优秀成果奖","全国绿色建筑创新奖","工业设计奖","建筑企业政府奖励","农产品金奖","中华农业科技奖","创新创业奖",
        "国家级科技研发中心","国家重点实验室","产学研联合实验室","临床医学研究中心","工业设计中心","工程技术研究中心",
        "企业技术中心","高企认定","高新技术企业","技术先进型服务企业","软件企业","科技型中小企业","集成电路设计企业",
        "系统集成企业","软件产品登记","动漫企业","著名商标","驰名商标","中华老字号","公用品牌","优质品牌"]
#示范、试点、基地类
dic5 = ["智能制造试点示范","申报试点城市","绿色矿山试点单位","产业集群试点","休闲农业和乡村旅游示范","绿色矿山试点",
        "专利运营试点","知识产权试点示范","知识产权示范企业","城市共同配送试点企业","示范休闲农庄","工业产品生态设计示范企业",
        "工业产品绿色设计示范企业","标准化试点示范项目","信息化和工业化融合管理体系贯标试点","首台重大技术装备保险补偿机制试点",
        "首套重大技术装备保险补偿机制试点","产学研合作创新示范企业","创新性企业试点","国家技术创新示范企业",
        "工业产品生态设计示范","中小企业公共服务示范平台","电子商务示范基地","小型微型企业创业示范基地","国家技术创新示范企业",
        "国家应急产业示范基地","智能制造试点示范","纺织服装创意设计园区试点示范","纺织服装创意设计平台试点示范",
        "制造业“双创”平台试点示范","电信和互联网行业网络安全试点示范","中小学知识产权教育试点","知识产权示范城市",
        "国外智力成果示范推广基地","国家引进国外智力示范","金融支农服务创新试点","现代农业示范区","国家级海洋牧场示范区",
        "国家林业标准化示范","“互联网+”智慧能源示范","能源互联网示范","多能互补集成优化示范","电子商务进农村综合示范",
        "电子商务示范","森林食品基地","标准化试点示范","农民合作示范社","甩挂运输试点","增值税试点","孵化器认定",
        "孵化示范基地","区域品牌建设试点","企业创业示范基地","国家农产品质量安全县创建试点","国家农产品质量安全市创建试点",
        "服务型制造示范","两化融合管理体系贯标示范","省级小企业创示范基地","国家有机产品认证示范区",
        "国家级生态原产地品保护示范区","博士后创新实践基地","小企业创业基地","创建工业设计示范园区","工业品牌培育示范",
        "智能制造合作试点示范"]
#人才类
dic6 = ["博士后创新人才支持计划","人才工程国家级人选","千人计划","人才计划","领军人才","代表性传承人","科技人才","创新创业"]
#其他类
dic7 = ["星火计划","火炬计划","国家重点新产品计划","软科学","科技成果转化","农业科技成果转化","技术先进型服务企业","企业资质",
        "清洁生产专项资金","免税政策资格","免费开放","重点项目","博士后科研项目","专项资金支持项目","研究课题征集",
        "重大技术装备首台","重大技术装备首套","研究课题","研究项目","学术和技术带头人培养支持经费","外经贸发展专项资金",
        "电商平台企业发展","军品配套科研项目","工业节能与绿色发展重点信贷","重大项目配套装备产品","民参军技术与产品推荐目录",
        "军用技术转民用推广目录","后勤军民融合创新成果","进口贴息","外经贸发展","军民融合产业","家庭农场","电子商务建设项目",
        "计划项目配套资助","产学研合作项目","科技计划项目","技术创新重点项目","就业创业","产业化贷款贴息项目","资助政策",
        "军用技术再研发和军民结合产业化项目","稳增长政策工业和科技创新扶持资金","现代农业暨特色效益农业项目","技术改造专项",
        "产业化发展财政补助项目","示范区建设项目","农业产业化银行贷款贴息","农业机械购置补贴","新材料重大科技专项",
        "农业标准化品牌化建设项目","服务业发展引导资金","基金创新融资基金项目","营业税优惠政策","企业所得税优惠政策",
        "电子信息产业发展基金","物联网发展","投资补助和贴息项目","科技创新项目","中欧国际合作项目","技术创新基金项目",
        "投资补助政策","战略性新兴产业","中国制造2025","工业机器人产业","戏曲专项","文化艺术智库项目","重点活动承办地",
        "国家级非物质文化遗产代表性项目","大型舞台剧和作品滚动资助项目","全国科研项目","科技新星计划","全国名特优新农产品目录",
        "民族医诊疗中心","优秀水利企业","优秀水利企业家","博士后创新人才支持计划","免税政策资格","免费开放专项资金",
        "军民融合产业","非物质文化遗产特色小镇","集成电路产业研究与开发专项资金","重点服务进口贴息项目",
        "中小企业成长工程培育企业","金融业发展专项","综合示范城市服务业集约化项目","能减排示范企业专项资金项目",
        "中小企业发展资金项目申报","科技服务业发展专项","科技创新","农业综合开发土地治理项目","高新技术产业化项目",
        "智慧商圈建设项目","农业科技成果转化项目","慢性病防治科技重大专项","国家级院所来津发展项目","汽车平台进口发展",
        "农业综合开发土地治理项目","农业重点项目","贷款贴息项目","国有实体书店项目","科技计划","科技服务业发展","专精特新",
        "内贸流通服务业发展促进资金项目","中央外经贸发展专项","研发费用加计扣除税收","工业转型升级","倍增计划",
        "技术标准研制资助","科技金融","国际科技合作"]

"""
算法三、标题出现以下任意两个部分就排除的结果
"""
# 任意两部分可以互相关联，中间不需要其他词分割的反向词
dic8 = [("印发","办法"),("印发","方案"),("印发","意见"),("印发","目录"),("印发","评价"),("印发","工作"),("印发","合同"),
        ("印发","名录"),("评选","公告"),("报送","情况"),("启动","会议"),("评选","先进"),("会","精神"),("档案","转移"),
        ("填报","需求"),("询价","公告"),("编报","项目"),("发布","决定"),("开展","讲座"),("印发","汇编"),("印发","指引"),
        ("发布","标准"),("确定","通知"),("组织","捐款"),("调整","信息"),("调整","政策"),("会议","有关事宜"),("工作","会议"),
        ("公布","补助目录"),("印发","试行"),("印发","处理规定"),("修改","意见"),("预拨","资金"),("绩效","工作"),
        ("收","节目"),("优秀","评选"),("评选","优秀"),("印发","表"),("印发","规划"),("印发","文"),
        # add 2017-12-28
        ("认定","办法"),("认定","名单"),("认定","为"),("认定","结果")
        ]
# 任意两部分不能相互关联，中间必须有词将其分开
dic9 = [("推荐","工作"),
        # add 2017-12-28
        ("认定","意见"),("印发","规则"),("发布","成果"),
        # add 2018-01-04
        ("获","认定"),("表扬","奖"),
        ("获","称号"),("表扬","项目"),("表扬","人"),("获得","支持"),("获","奖"),("修订","条例"),("关于","决定"),
        ("计划生育", "奖"),("获","支持"),("完成","评价"),("项目","实施"),("启动","个"),("业","实施意见"),
        # add 2018-01-11
        ("领取", "证书"),("情况","调查"),("印发","政策措施"),("征集","专家"),("办理","业务"),("开展","调查"),
        ("填报", "表"),("新建","广场"),("抓好","工作"),("公布","单位"),("完善","数据"),("污染天气","预警"),
        ("填报", "调查表"),("设立","公司"),("成功","基地"),("公布","人"),("公布","项目"),("发布","目录"),
        ("公布", "目录")
        ]
# 任意三部分关联，需要将其排除出去
dic11 = [("评选","十","大")]
"""
算法四、标题出现以下关键词时的结果就排除
"""
# 单独出现需要将其排除的反向词汇
dic10 = ["正式运行","废止","关于同意","入选","问题答疑","资格考试","清算","绩效评价办法","裁判员","集训","专项调查","宣传片",
         "推广合作伙伴","竞赛规程","中期调整","同意","试运行","中标公告","更正公告","废标公告","成交公告","会员",
         "操作手册","预告","企业更名","通报","报告会","免试","推荐生","公租房","评选投票","网页","结果公告","抽查",
         "核准","对接会议","优秀学生评选","上岗","摄影作品","比选","研究生奖学金","挂职","职称评定","管理改革方案","运动会",
         "免试生", "调剂","对接会","专项资金管理","换届工作","专项抽查","诚招","项目初评工作","审查",
         "结束通知","获批","评价工作","下达","批复方式","实施细则","申请办理","竞争性谈判","遴选公告","调研",
         "问卷调查工作","结果公布","印发修订","会计制度","资金管理","支付有关问题","项目任务", "清算工作","项目支出","大会",
         "资金使用管理","有关事宜","评审结果","中期评估","项目立项","项目实施","管理办法","管理规定","实施办法","暂行","授牌",
         "综合评审会","招标","公示","研讨班","招聘","返聘","岗位","验收","任务书","工作会议","座谈会","建设工作",
         "总结","答辩会","若干意见","评审","培训","专项规划","评估","评价结果","检测结果","办公室公告","专项审计",
         "财务审计","合同事宜","名单","咨询","表彰","征求","答辩","落实","召开","结题","学术论文","考评","考核","研讨会",
         "预算","决算","概算","统计","专项整治","专项治理","专项督查","考察","研修","授课","换证","变更","发展情况","洽谈",
         "活动","组织观看","组织学习","颁发","解读","影片","电影","个人评选","周年","预赛","组织成立","换届改选","批准",
         "诚聘","遴选会议","推荐会议","汇报会议","会议章程","电话会议","视频会议","会议通知","典型经验","竞争性磋商","选派",
         "公派","评选结果","奖学金评选","评选办法","命名","督查","提案","推介","编制","参观访问","程序","强调","公众","招募",
         "评选结果","初审结果","交流会","颁奖","审核","奖励办法","专项行动","立项公告","成为","拨付","检查","采购",
         "标准发布公告","成立","反腐","课题立项","规则","锦标赛","工作安排","工作会","授予","出席","讲话","推进会","推荐会",
         "年度工作","获奖","收看","开学","万元","立项通知","投标","招生","通知书","助学金","加大","加快","鉴定","声明","排查",
         "直播","发放","徽标","确认","展示会","管理工作","警示","仪式","受理","护照","学习班","选举","创新论坛","租房","开标",
         "报告","会议计划","核对","扑克","新闻发布","手续","收费","审批","救灾",
         #add 2017-12-28
         "认定申请表","资格认定","体检","低收入","工伤","请示","代理","登记","会议制度","监理信息","监理资质","补贴","面试",
         "汇总表","公共租赁住房","备案申请表","公开遴选","选聘","督导","涉税","会议审议","资格预审","立案","参观指导",
         "拨款","考试录用","谈判","科技创新工作","随机抽取","演练","施工单位","指导价","梳理表","安置","残疾证","保证金",
         "抽样","贫困家庭","两学一做","党费","挂牌上市","烹饪","新增",
         #add 2018-01-04
         "棚户区改造","旧城改造","中华人民共和国促进科技成果转化法","建设实施方案","实施意见","表扬","招商公告","项目法人",
         "最低生活补助","批复","救助","作文","见习基地","喜获佳绩","再添","揭晓","再获","再创","列入",
         "独家专访","观摩","新农合","项目环境影响评价","现场视察","工程施工","榜上有名","权限清单","事项清单","专题讲座",
         "摄影","邀请","应急响应","医疗补助","推进情况","恢复","指导线","征收","购买服务","图案设计","设计方案","摇号",
         "中标","清查工作","抚恤补助","独生子女奖","五保户","低保",
         "大病医疗救助","法律援助","广交会","特许经营项目","公益广告","建设地点","监理资格","知识竞赛","目标任务",
         "入围","核查","督查","学术讲座","公务卡",
         "排放限制","权利权限","自查自纠","完成情况","慰问","领导小组","李克强","助学贷款","政策清单",
         "现场视察","违法停车","生活救助","挂图作战","劳动模范","新型农村合作医疗","旬报制","容积率","黄色预警",
         "PPP模式","企业规范公告","流标","廉租","喜获佳绩","榜上有名","经营者备案","施工用电","新突破","再获殊荣",
         "专题讲座","集中开工","引入社会投资人","LOGO","房屋征收",
         "志愿","办学条件","学生资助","总产值","语文","购物节","月饼节","困难学生","教辅","初评","幼儿园","怎么办",
         "微课大赛","全市第一","对接合作","实践基地","成效显著","困难补助","60周岁","统筹管理",
         # add 2018-01-11
         "情况调查","预告内容","宣传工作","家庭经济困难","巡回展","农机购置补贴","博览会","聘任","聘用","汇演","应届",
         "状况调查","设计方案","节目单","评奖办法","共产党","指导线","运营管理","项目安排公告","排行","调查表","情况自查",
         "摸底调查","免费开放日","情况图解","修改方案","许可证","听证会","环境影响评价","联谊会","街道办事处",
         "指标调整","合同填报事宜","监理工作","安排情况","置换方案","行政权力","调查工作","摸底",
         "专项整顿","双过半","全年投资计划","科研不端行为处理办法","角逐出","占一补一","评价流程","川南区志",
         "考调","教师资格","下放行政许可","被确定为","项目整改等相关事宜","排放限值","显著成果","美食画册",
         "完成投资","全国人口普查","灾后重建","统一社会信用代码","使用权","三同时","举报平台","参观",
         "公告发布时间","点击量","结硕果","制博会","亿元","督办","相关业务分工","决定给予","营业税改征增值税",
         "住房保障","优秀毕业生","留守学生","撸起袖子","毕业","冒充","贫困大学","提名","巡察","骗取",
         "信息化大赛","文轩杯","形势良好","被评选","成功申报","全国实施","监察","听证会","基金项目目录清单",
         "民生工程项目","职业病","免费开放日","勘误","注销","节目预报","即将到期","请示",
         "二手车","弄虚作假","高水平运动","政府和社会资本合作","校聘","暂停新业务开通","专项资金立项"
         ]


